@duedares-rvj Thanks for your update. I have taken a look at this and its not related to a mix of variables but instead to do with the design pattern that we have been using for a long while. So to first explain the logic. We have an M2M token that is responsible for creating another environment scoped M2M tokens.

 This first M2M token is set at the environment level and applied to the default auth0 provider

```bash
export AUTH0_DOMAIN=example.com
export AUTH0_CLIENT_ID=foo_client
export AUTH0_CLIENT_SECRET=foo_secret
```

I have mocked up an example for you that you can use to reproduce the issue. 

**some_auth0_module.tf**
```hcl
terraform {
  required_providers {
    random = {
      source  = "hashicorp/random"
      version = "3.6.2"
    }
  }
}

# Use this is fake way to generate a client ID at apply time. This would normally be "auth0_client" rsource
resource "random_string" "user_management_m2m_token" {
  length = 16
}

output "m2m_user_management_client_id" {
  value = random_string.user_management_m2m_token.result
}
```
**root modules main.tf**
```hcl
terraform {
  required_providers {
    random = {
      source  = "hashicorp/random"
      version = "3.6.2"
    }
    auth0 = {
      source  = "auth0/auth0"
      version = "1.7.3"
    }
  }
}

module "auth0_config" {
  source = "./some_auth_module"
}

# This is added in the root module to avoid using the output from the auth0_config module as the data lookup can be
# delayed due to dependencies, as otherwise this causes reads on the provider alias to fail during the object refresh when planning
data "auth0_client" "user_management_m2m" {
  client_id = module.auth0_config.m2m_user_management_client_id
}

provider "auth0" {
  alias         = "user_management_auth0"
  client_id     = module.auth0_config.m2m_user_management_client_id
  client_secret = data.auth0_client.user_management_m2m.client_secret
}

resource "auth0_user" "internal_admin_user" {
  provider = auth0.user_management_auth0
  connection_name = "foo"
  email           = "test-user@example.com"
  email_verified  = true
}
```

Now if i run this with version 1.7.1 then it plans fine, and when its applied, the value of the client_id will be set on the provider before the provider is invoked.

**1.7.1 plan**
```
$ terraform plan
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.auth0_client.user_management_m2m will be read during apply
  # (config refers to values not yet known)
 <= data "auth0_client" "user_management_m2m" {
      + addons                                = (known after apply)
      + allowed_clients                       = (known after apply)
      + allowed_logout_urls                   = (known after apply)
      + allowed_origins                       = (known after apply)
      + app_type                              = (known after apply)
      + callbacks                             = (known after apply)
      + client_aliases                        = (known after apply)
      + client_authentication_methods         = (known after apply)
      + client_id                             = (known after apply)
      + client_metadata                       = (known after apply)
      + client_secret                         = (sensitive value)
      + compliance_level                      = (known after apply)
      + cross_origin_auth                     = (known after apply)
      + cross_origin_loc                      = (known after apply)
      + custom_login_page                     = (known after apply)
      + custom_login_page_on                  = (known after apply)
      + default_organization                  = (known after apply)
      + description                           = (known after apply)
      + encryption_key                        = (known after apply)
      + form_template                         = (known after apply)
      + grant_types                           = (known after apply)
      + id                                    = (known after apply)
      + initiate_login_uri                    = (known after apply)
      + is_first_party                        = (known after apply)
      + is_token_endpoint_ip_header_trusted   = (known after apply)
      + jwt_configuration                     = (known after apply)
      + logo_uri                              = (known after apply)
      + mobile                                = (known after apply)
      + native_social_login                   = (known after apply)
      + oidc_backchannel_logout_urls          = (known after apply)
      + oidc_conformant                       = (known after apply)
      + organization_require_behavior         = (known after apply)
      + organization_usage                    = (known after apply)
      + refresh_token                         = (known after apply)
      + require_proof_of_possession           = (known after apply)
      + require_pushed_authorization_requests = (known after apply)
      + signed_request_object                 = (known after apply)
      + signing_keys                          = (known after apply)
      + sso                                   = (known after apply)
      + sso_disabled                          = (known after apply)
      + token_endpoint_auth_method            = (known after apply)
      + web_origins                           = (known after apply)
    }

  # auth0_user.internal_admin_user will be created
  + resource "auth0_user" "internal_admin_user" {
      + connection_name = "foo"
      + email           = "test-user@example.com"
      + email_verified  = true
      + id              = (known after apply)
      + name            = (known after apply)
      + nickname        = (known after apply)
      + picture         = (known after apply)
      + user_id         = (known after apply)
    }

  # module.auth0_config.random_string.user_management_m2m_token will be created
  + resource "random_string" "user_management_m2m_token" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = true
      + upper       = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── 

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
```

However if we upgrade to `1.7.3` version of the provider then this now fails because the validation is happening when the provider is initialised instead of allowing it to load that configuration lazily from values that are known at apply time.

```
$ terraform plan
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.auth0_config.random_string.user_management_m2m_token will be created
  + resource "random_string" "user_management_m2m_token" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = true
      + upper       = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Error: Invalid provider configuration
│
│ Provider "registry.terraform.io/auth0/auth0" requires explicit configuration. Add a provider block to the root module and configure the provider's required arguments as described in the provider      
│ documentation.
│
╵
╷
│ Error: Missing environment variables
│
│   with provider["registry.terraform.io/auth0/auth0"],
│   on <empty> line 0:
│   (source code not available)
│
│ Either AUTH0_API_TOKEN or AUTH0_DOMAIN:AUTH0_CLIENT_ID:AUTH0_CLIENT_SECRET must be configured. Ref: https://registry.terraform.io/providers/auth0/auth0/latest/docs
╵
```